/*
  Worksheet simple
  LAB 1 : WS_simple_OLEDText
  โปรแกรม : การแสดงข้อความพื้นฐานบนจอ OLED
  โจทย์เงื่อนไข :  ใช้งานจอ OLED ด้วยการกำหนดพิกัดตำแหน่ง X และ Y และขนาดตัวอักษร
  คำแนะนำ : ให้นักเรียนเติมเต็มตรรกะในฟังก์ชันการแสดงผลจอ OLED
*/

#include "MiniMicroKit_PTL.h"

MiniMicroKit_PTL kit;

void setup() {
  kit.begin();
}

void loop() {
  kit.update();
  kit.clearDisplay(); // ล้างหน้าจอก่อนวาดภาพใหม่
  
  // แสดงหัวข้อโครงงานที่พิกัด X=5, Y=2, ขนาดตัวอักษร 1
  kit.printText("=== MY PROJECT ===", 5, 2, 1);

  // ให้นักเรียนเติมคำสั่ง printText เพิ่มเติมตามต้องการ
  // โจทย์ข้อ 1. ให้นักเรียนเขียนคำสั่ง แสดงชื่อของนักเรียนหรือกลุ่มที่พิกัด X=5, Y=20, ขนาด 1
  // โจทย์ข้อ 2. ให้นักเรียนเขียนคำสั่ง แสดงสถานะระบบ "Status: READY" ที่พิกัด X=5, Y=45, ขนาด 1 
  
  kit.displayUpdate(); // อัปเดตข้อมูลแสดงผลออกทางจอ OLED
  delay(1000);
}